# Taps
tap "anomalyco/tap", trusted: true

# CLI utils
brew "fd"
brew "fnm"
brew "fzf"
brew "git"
brew "lazygit"
brew "mole"
brew "neovim"
brew "ollama"
brew "pnpm"
brew "ripgrep"
brew "rustup"
brew "anomalyco/tap/opencode"
brew "starship"
brew "yazi"

# Apps
cask "appcleaner"
cask "calibre"
cask "claude-code"
cask "docker-desktop"
cask "emacs-app"
cask "ghostty"
cask "google-chrome"
cask "postico"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "wezterm"
cask "whatsapp"

# Fonts
cask "font-cascadia-code"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
