# CLI utils
brew "git"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "fnm"
brew "tmux"
brew "tpm" # tmux plugin manager
brew "neovim"
brew "starship"
brew "pnpm"
brew "rustup"
tap "sst/tap"
brew "sst/tap/opencode"

# Apps
cask "google-chrome"
cask "ghostty"
cask "slack"
cask "spotify"
cask "whatsapp"
cask "cursor"
cask "visual-studio-code"
cask "docker-desktop"
cask "appcleaner"

# Fonts
cask "font-cascadia-code"
cask "font-hack-nerd-font"
