# CLI utils
brew "git"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "fnm"
brew "tmux"
brew "tpm" # tmux plugin manager
brew "neovim"
brew "nb"
tap "charmbracelet/tap"
brew "crush"
brew "powerlevel10k"

# docker
cask "docker"

# Apps
cask "ghostty"
cask "slack"
cask "spotify"
cask "whatsapp"
cask "cursor"
cask "visual-studio-code"
cask "postico"

# Fonts
cask "font-cascadia-code"
cask "font-hack-nerd-font"
